/******************************************************************************************
 * plati_temp.c
 * ver1.00
 * Tetsuya Kaku
 *=========================================================================================
 * 白金薄膜温度センサデータ取得ソース・ファイル
 *
 *=========================================================================================
 * ・ver1.00 || 2016/01/14 || Tetsuya Kaku
 *   初版
 *=========================================================================================
 * PIC16F877A
 * MPLAB X IDE(v3.10/Win)
 * XC8 (v1.35/Win)
 *=========================================================================================
 * Created by fabsat Project(Tokai university Satellite Project[TSP])
 *****************************************************************************************/
#include <xc.h>
#include <pic16f877a.h>
#include "pic_setting.h"
//#include "pic_clock.h"
#include "AD_value.h"
#include "plati_temp.h"


/*-----------------------------------------------------
 * @breif
 *     AD変換した値から温度データに変換する関数
 * @param
 *     なし
 * @return
 *     白金薄膜温度データ
 * @note
 *     plati_temp.c内で使用する関数なのでstatic関数
 *---------------------------------------------------*/
double get_temp(double volt)
{  
    double r1, r2, t1, t2;
    double a = 0.0039083;
    double b = -0.0000005775;
   
    //温度算出の計算
    r1 = (volt / (5.0 - volt)) * 3900.0;      //3.9k//5.6k //2.4k//5.0Vを4.7kΩで分圧しているため
    t1 = (r1 / 100.0 - 1.0) / a;
    r2 = ((t1 * b + a) * t1 +1.0) * 100.0;   
    t2 = (r1 / 100.0 - r2 / 100.0) / a + t1;

    return t2;
}


/*=====================================================
 * @brief
 *     温度データ取得関数
 * @param
 *     なし
 * @return
 *     平均温度データ
 * @note
 *     温度を取得する関数
 *===================================================*/
/*
double get_temp(void)
{
    double t_average = 0.0;
    int i;
    
    //温度データの平均化
    for(i = 0; i <= 300; i++){
        t_average += get_pt();
    }
    t_average /= 300.0;

    return t_average;
}
*/


